# coding=utf-8
"""
Строковые константы для кнопок
"""

EXIT_CMD = u"Выход"
GAME_OVER_MSG = u"Игра окончена"

ASK_FOR_PROMO_MSG = u"Чтобы продолжить, введите сюда промокод, который выдал вам таймпад при покупке билета"
NEXT_QUESTION_CMD = u"Следующий вопрос"
BACK_CMD = u"Назад"
START_MSG = u"Приветствую! Это бот Факторизация отношений"
PARTNER_MSG = u"Ваш партнер уже тут, и вы в игре"
SEND_PROMO_MSG = u"Это игра на двоих! Перешлите промокод своему партнеру. Когда он/она присоединится, начнется игра"
NO_SUCH_GAME_MSG = u"Такой игры нет!"
HELP_MSG = START_MSG  # TODO make help
WAIT_FOR_PARTNER_MSG = u'Чтобы двинуться дальше, ваш партнер должен тоже нажать "Следующий вопрос"'
FINISH_FACT_CMD = u'Закончить факторизацию'
START_CMD = u'Начать'
NO_MORE_QUESTIONS_MSG = u'Вопросов в этой категории больше нет'
SELECT_CATEGORY_MSG = u"Для начала выберите фактор, который хотели бы обсудить подробнее. Внимание! Игра не начнется пока оба партнера не выберут один и тот же фактор"
